import styles from "./css/main.module.css";
import { RecipeHead } from "./RecipeHead";
import { RecipeIngredients } from "./RecipeIngredients";
import { RecipeInstructions } from "./RecipeInstructions";
import { RecipesNavigation } from "./RecipesNavigation";

export const RecipeThree = () => {
	return (
		<div className={styles.container}>
			<RecipesNavigation />
			<RecipeHead 
				title="Българска баница с готови кори"
				quote="Най-обичаната българска баница в лесен за приготвяне вариант
				с готови кори."
			/>
			<RecipeIngredients
				ingredients=
				{[
					'кори за баница - 1 пакет (500 г)',
					'мазнина - 150 мл олио и масло 50х50',
					'яйца - 5 бр.',
					'кисело мляко - 1 кофичка 400',
					'бакпулвер - 1 бр.',
					'сирене - 300 г (може и повече, ако обичате)',
				]}
			/>
			<RecipeInstructions
				instructions=
				{[
					`В купа разбийте яйцата, добавете киселото мляко и
					бакпулвера, разбъркайте.`,
					`Натрошете сиренето отделно. Разтопете маслото в олиото, за
					да се смесят добре.`,
					`С четка намажете корите с мазнината две по две. На всяка
					двойка кори сипвате равномерно по 5-6 с.л. от сместа и
					поръсвате със сирене, така по-лесно се контролира
					количеството.`,
					`Навийте корите на рула откъм късата им страна, за да станат
					по-дебели парчетата и по-сочна баницата. Навийте рулата в
					тава, намазана с мазнина, на охлюв и намажете отгоре с малко
					мазнина.`,
					`Поставете тавата в предварително нагрята на 180 °C фурна на
					средна скара и печете за 40-45 минути до готовност.`,
					`Извадете баницата и я обърнете върху скара наопаки, за а се
					задуши от собствените си изпарения за 10-15 минути и
					най-вече така задушена баницата се отделя по-лесно от
					тавата.`,
				]}
			/>
		</div>
	);
};
