import styles from "./css/main.module.css";
import { RecipesNavigation } from "./RecipesNavigation";
import { RecipeInstructions } from "./RecipeInstructions";
import { RecipeIngredients } from "./RecipeIngredients";
import { RecipeHead } from "./RecipeHead";

export const RecipeOne = () => {
	return (
		<div className={styles.container}>
			<RecipesNavigation />
			<RecipeHead
				title="Рогчета като от пекарна"
				quote="Маслени, пръхкави и много вкусни рогчета, които едно време
				се продаваха в училищните лафки."
			/>
			<RecipeIngredients
				ingredients=
				{[
					"брашно - около 500 г",
					"вода - 100 мл",
					"мая - 10 г прясна (1/4 от кубче)",
					"захар - 1 с.л. сол - 1 ч.л.",
					"яйца - 1 бр. + 1 белтък",
					"мас - 130 г",
					"олио - 50 мл",
					"сирене - 150 г",
					"жълтък - 1 бр.",
					"вода - 1 с.л.",
					"семена - за поръсване",
				]}
			/>
			<RecipeInstructions
				instructions=
				{[
					`Затоплете 100 мл вода и разтворете в нея маята и захарта.`,
					`В друг съд пресейте брашното и добавете към него солта. Разбъркайте и оформете кладенче.`,
					`Добавете сместа с маята, свинската мас, олиото, 1 цяло яйце
					и белтъка на второто и замесете меко тесто. Жълтъка на
					другото яйце заделете, то ще ви трябва за намазване на
					рогчетата.`,
					`Тестото е много маслено и не лепи. Готовото тесто поставете
					в купа и покрийте със стреч фолио и кърпа.`,
					`Оставете го да втаса за около час.`,
					`След това разделете тестото на 10 равни части.`,
					`Всяка от тях разточете на тънка кора върху леко набрашнена
					повърхност. Поръсете с натрошено сирене и навийте като
					рогче.`,
					`За плънка може да използвате и настърган кашкавал или
					смесени сирене и кашкавал.`,
					`Подредете рогчетата в тави, покрити с хартия за печене, на
					разстояние едно от друго и ги оставете отново да втасат -
					този път за 20 минути.`,
					`След това намажете рогчетата със заделения жълтък, който
					смесете с малко вода или прясно мляко и поръсете със семена
					по избор.`,
					`Сложете да се пекат в предварително загрята фурна на 200°C
					за 25-30 минути до хубав златист загар.`,
				]}
			/>
		</div>
	);
};
