import { Link } from "react-router-dom";
import logo from "../../resources/images/logo_arrow_back.svg";
import bitcoinImage from "../../resources/images/bitcoin_etherium_1920.jpg";
import { PostHeading } from "./PostHeading";
import { PostBody } from "./PostBody";

export const PostOne = () => {
	const paragraphs = [
		`Анализатор с псевдоним <em>„Cheds“</em> каза на своите
		последователи в Twitter, че при Биткойн може да има голямо рали
		и че актива е готов да реализира обрат на мечата тенденция.`,
		`Над $18,200 се открива възможност за обратен модел на глава
		и рамене, множество рамене (или широка лява част) и глава с
		основа при $25,500.`,
		`<em>Над $18,200 се открива възможност за обратен модел на глава
		и рамене, множество рамене (или широка лява част) и глава с
		основа при $25,500.</em>`,
		`Също така той прогнозира, че Биткойн може да стигне до ниво от
		$37,000 след май, ако преодолее съпротивата около $25,500, което
		е скок от 76% от текущата цена от около $21,000.`,
		`Стратегът също така каза, че страхът от пропускане (FOMO) може
		да накара трейдърите да очакват евентуално рали на актива. Cheds
		добави, че Биткойн успя да затвори над 200-дневната пълзяща
		средна, което според него е знак за забележителна сила.`,
		`Що се отнася до алткойните, той заяви, че те в крайна сметка
		може да последват експлозивното ценово действие на BTC, след
		като флагманската криптовалута се консолидира.`,
	];
	return (
		<>
			<Link to="/postortable">
				<img src={logo} width="25" title="Go back" alt="Arrow back" />
			</Link>
			<PostHeading
				title="Биткойн: Анализатор прогнозира 75% скок – ето кога"
				imageSource={bitcoinImage}
				altText="Bitcoin and other altcoins"
				imageWidth="750"
			/>
			<PostBody
				paragraphs={paragraphs}
			/>
		</>
	);
};
