import { Link } from "react-router-dom";
import logo from "../../resources/images/logo_arrow_back.svg";
import comet from "../../resources/images/comet_1280.jpg";
import { PostHeading } from "./PostHeading";
import { PostBody } from "./PostBody";

export const PostFour = () => {
	const paragraphs = [
		`Наскоро открита комета ще се появи в нощното небе над нас за
		първи път от 50 000 години. Тя е забелязана от астрономите на 2
		март 2022 г. Това се е случило с камера за широкообхватно
		изследване в обсерваторията Паломар в Сан Диего, Калифорния.`,
		`Според НАСА кометата C/2022 E3 (ZTF) ще се доближи най-близо до
		Слънцето на 12 януари.`,
		`Орбитата на планетата е около голямата звезда, но преминава през
		външните части на нашата слънчева система. Поради това са били
		необходими десетки хиляди години кометата отново да се „залюлее“
		покрай Земята, съобщава bTV.`,
		`На 12 януари тя може да бъде забелязана от Северното полукълбо с
		телескоп и бинокъл. Любителите на небесното пространство трябва
		да гледат ниско към североизточния хоризонт точно преди полунощ.`,
		`Леденият небесен обект, който постоянно свети, докато се
		приближава към Слънцето, ще премине най-близо до Земята между 1
		и 2 февруари. Тогава C/2022 E3 (ZTF) ще бъде на разстояние от
		около 42 милиона километра, посочва EarthSky.`,
		`Тя ще може да се забележи близо до ярката звезда Поларис,
		наричана още Полярна звезда или Северна звезда – най-ярката в
		съзвездието Малка мечка.`,
		`Тогава кометата ще може да бъде видяна в небето на Северното
		полукълбо през по-голямата част от януари. В Южното полукълбо –
		в началото на февруари, посочва НАСА.`,
		`В зависимост от това колко ще нараства нейната яркост, към края
		на януари при тъмно небе тя може да стане видима дори с
		невъоръжено око.`,
		`Яркостта на кометите обикновено е непредсказуема, но сегашното
		поведение на C/2022 E3 (ZTF) е обещаващо, коментира учен от
		американската космическа агенция.`,
		`Кометата се различава от звездите по ивичестите опашки от прах и
		енергизирани частици, както и по своята зелена кома – облак от
		космически прах, лед и газове, които обгръщат ядрото ѝ. Комата и
		ядрото образуват главата на кометата.`,
		`С приближаване към Слънцето главата се увеличава, летливите
		вещества се затоплят и се изхвърхлят под формата на опашка.`,
		`Поради тези процеси кометата изглежда размита, когато се
		наблюдава през телескоп.`,
		`Астрономите съветват всеки, който се надява да я види, да избере
		място без изкуствени светлини и да предвиди около 30 минути, за
		да се приспособят очите към тъмнината.`,
		]
	return (
		<>
			<Link to="/postortable">
				<img src={logo} width="25" title="Go back" alt="Arrow back" />
			</Link>
			<PostHeading
				title="Зелена комета минава край Земята за първи път от 50 000 години"
				imageSource={comet}
				altText="A picture ot comet in space"
				imageWidth="750"
			/>
			<PostBody
				paragraphs={paragraphs}
			/>
		</>
	);
};
